<a href="https://colab.research.google.com/github/dieguito1331/cienciaDatos/blob/master/maestria/teoria/01 - Introduccion a Pandas (Titanic).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Pandas ##
Pandas es la librería por excelencia para el manejo de Dataframes. Es una de las liberarías open Source de programación en Python más populares. Está construida sobre otra librería muy utilizada que es la librería Numpy.  
La librería soporta dos grandes estructuras, a saber:  
1) Series
2) DataFrame

#### ¿Pero que es un dataframe? ####
Un DataFrame es una estructura de datos con dos dimensiones en la cual se puede guardar datos de distintos tipos (como caractéres, enteros, valores de punto flotante, factores y más) en columnas. Es similar a una hoja de cálculo o una tabla de SQL o el data.frame de R. Un DataFrame siempre tiene un índice (con inicio en 0). El índice refiere a la posición de un elemento en la estructura de datos.  
Es una estructura de 2 dimensiones etiquetadas que posee registros y columnas (potencialmente cada columna podrá tener diferente tipo de datos como integers, strings, floats, None, Python Objects, etc)  

#### ¿Y una serie? ####
Series es la estructura de datos para una sola columna de una DataFrame, no solo conceptualmente, sino que literalmente, es decir, los datos de una DataFrame se almacenan en la memoria como una colección de Series.  
En otras palabras, es una estructura de una sola dimensión que almacena un tipo de datos. La suma de varias series, arman un DataFrame.  


De manera análoga: Necesitamos listas y matrices, porque las matrices se crean con listas. Las matrices de una fila, mientras que las listas en la funcionalidad aún no pueden existir sin la (s) lista (s) de las que están compuestas.

### ¿Cómo instalamos Pandas? ###
En varias distribuciones de Python (Como Anaconda o WinPython), Pandas ya viene pre instalados, no obstante, si no lo tenemos instalado en nuestro ambiente de trabajo, se puede instalar utilizando PyPI (Python Package Index - es un índice global en donde se encuentran TODAS las librerías de Python open-source) utilizando alguno de los siguientes comandos:  
1) pip install pandas ó
2) pip3 install pandas ó  
3) conda install pandas (para distribuciones de Anaconda)

Uno de los grandes puntos a tener en cuenta con librerías de este estilo es que las mismas se encuentran "vivas", es decir, se actualizan todo el tiempo. Para poder actualizar la instalación de pandas en nuestro entorno de trabajo podemos usar los siguientes scripts:  
1) pip install --upgrade pandas ó
2) pip3 install --upgrade pandas ó
3) python -m pip install --upgrade pandas
4) pip install pandas==*version_especifica que quiero instalar*
5) conda update pandas==*version_especifica que quiero instalar*

In [5]:
import pandas
pandas.__version__

'2.0.3'

In [6]:
import pandas as pd
import numpy as np

### Creación de una Serie

In [8]:
#Creo una serie, mediante un Numpy Array

data = np.array(['python','php','java'])
series = pd.Series(data, name="lenguajes")
series

0    python
1       php
2      java
Name: lenguajes, dtype: object

In [11]:
diccionarios = {"key": "valor"}
diccionarios["key"]

'valor'

In [12]:
#Mediante un Diccionario
dict = {"curso": "Python", "institucion":"Digital House", "profesor": "Diego"}
pd.Series(dict)

curso                 Python
institucion    Digital House
profesor               Diego
dtype: object

In [14]:
#Mediante una lista
lista = ["Python", "Digital House", "Diego"]
pd.Series(lista, index =["curso", "institucion", "profesor"])

curso                 Python
institucion    Digital House
profesor               Diego
dtype: object

### Creación de un DataFrame

In [17]:
#Utilizando dos o más series
data1 = np.array(['python','php','java'])
series1 = pd.Series(data1, name = "lenguaje")

data2 = np.array([1,2,3])
series2 = pd.Series(data2, name = "ranking")

df = pd.concat([series1, series2], axis=1)
df

  lenguaje  ranking
0   python        1
1      php        2
2     java        3

In [20]:
#Mediante una matriz (En este caso de 3x2)
matrix = [["Python", 1], ["php", 2], ["java", 3]]
pd.DataFrame(matrix, columns = ["lenguaje", "ranking"])

  lenguaje  ranking
0   Python        1
1      php        2
2     java        3

In [52]:
#Desde un Diccionario
diccionary = {
    'lenguaje' : ["Python", "php", "java"],
    'ranking' : [1,2,3]
}
  
# creating a Dataframe object 
df = pd.DataFrame(diccionary)
df

  lenguaje  ranking
0   Python        1
1      php        2
2     java        3

In [37]:
df2 = pd.DataFrame([["Python", "Guido van Rossum",1], ["php", "Rasmus Lerdorf", 2], ["java", "James Gosling", 3]],
            columns=["lenguaje", "creador", "ranking"])
df2

  lenguaje           creador  ranking
0   Python  Guido van Rossum        1
1      php    Rasmus Lerdorf        2
2     java     James Gosling        3

### Haremos operaciones entre DataFrames ###

#### Join #####
Esta operación es equivalente al join de SQL y ejecuta sobre el índice del dataFrame
Se le puede definir el parámetro how, para indicarle si queremos que el join sea inner, left, right, outer, cross
Por defecto realiza un left

In [29]:
df.join(df2)

Unexpected exception formatting exception. Falling back to standard exception

Traceback (most recent call last):
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\IPython\core\interactiveshell.py", line 3508, in run_code
    exec(code_obj, self.user_global_ns, self.user_ns)
  File "C:\Users\Diego\AppData\Local\Temp\ipykernel_24260\3970274684.py", line 1, in <module>
    df.join(df2)
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\pandas\core\frame.py", line 9729, in join
    periods = int(periods)
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\pandas\core\frame.py", line 9768, in _join_compat
    return subset
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\pandas\core\reshape\merge.py", line 162, in merge
    sort=sort,
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\pandas\core\reshape\merge.py", line 811, in get_result
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\pandas\core\reshape\merge.py", line 763, in _reindex_and_concat
    self.indicator = indicator
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\pandas\core\reshape\merge.py", line 2604, in _items_overlap_with_suffix
    if not isinstance(lname, str) or not isinstance(rname, str):
ValueError: columns overlap but no suffix specified: Index(['lenguaje'], dtype='object')

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\IPython\core\interactiveshell.py", line 2105, in showtraceback
    stb = self.InteractiveTB.structured_traceback(
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\IPython\core\ultratb.py", line 1428, in structured_traceback
    return FormattedTB.structured_traceback(
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\IPython\core\ultratb.py", line 1319, in structured_traceback
    return VerboseTB.structured_traceback(
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\IPython\core\ultratb.py", line 1172, in structured_traceback
    formatted_exception = self.format_exception_as_a_whole(etype, evalue, etb, number_of_lines_of_context,
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\IPython\core\ultratb.py", line 1087, in format_exception_as_a_whole
    frames.append(self.format_record(record))
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\IPython\core\ultratb.py", line 969, in format_record
    frame_info.lines, Colors, self.has_colors, lvals
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\IPython\core\ultratb.py", line 792, in lines
    return self._sd.lines
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\stack_data\utils.py", line 144, in cached_property_wrapper
    value = obj.__dict__[self.func.__name__] = self.func(obj)
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\stack_data\core.py", line 734, in lines
    pieces = self.included_pieces
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\stack_data\utils.py", line 144, in cached_property_wrapper
    value = obj.__dict__[self.func.__name__] = self.func(obj)
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\stack_data\core.py", line 681, in included_pieces
    pos = scope_pieces.index(self.executing_piece)
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\stack_data\utils.py", line 144, in cached_property_wrapper
    value = obj.__dict__[self.func.__name__] = self.func(obj)
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\stack_data\core.py", line 660, in executing_piece
    return only(
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\executing\executing.py", line 190, in only
    raise NotOneValueFound('Expected one value, found 0')
executing.executing.NotOneValueFound: Expected one value, found 0

In [33]:
df2 = pd.DataFrame([["Python", "Guido van Rossum"], ["java", "James Gosling"], ["php", "Rasmus Lerdorf"]],
            columns=["lenguaje", "creador"], index = ["r1", "r2", "r3"])
df.join(df2, how= "inner")

Unexpected exception formatting exception. Falling back to standard exception

Traceback (most recent call last):
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\IPython\core\interactiveshell.py", line 3508, in run_code
    exec(code_obj, self.user_global_ns, self.user_ns)
  File "C:\Users\Diego\AppData\Local\Temp\ipykernel_24260\2142645719.py", line 3, in <module>
    df.join(df2, how= "inner")
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\pandas\core\frame.py", line 9729, in join
    periods = int(periods)
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\pandas\core\frame.py", line 9768, in _join_compat
    return subset
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\pandas\core\reshape\merge.py", line 162, in merge
    sort=sort,
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\pandas\core\reshape\merge.py", line 811, in get_result
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\pandas\core\reshape\merge.py", line 763, in _reindex_and_concat
    self.indicator = indicator
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\pandas\core\reshape\merge.py", line 2604, in _items_overlap_with_suffix
    if not isinstance(lname, str) or not isinstance(rname, str):
ValueError: columns overlap but no suffix specified: Index(['lenguaje'], dtype='object')

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\IPython\core\interactiveshell.py", line 2105, in showtraceback
    stb = self.InteractiveTB.structured_traceback(
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\IPython\core\ultratb.py", line 1428, in structured_traceback
    return FormattedTB.structured_traceback(
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\IPython\core\ultratb.py", line 1319, in structured_traceback
    return VerboseTB.structured_traceback(
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\IPython\core\ultratb.py", line 1172, in structured_traceback
    formatted_exception = self.format_exception_as_a_whole(etype, evalue, etb, number_of_lines_of_context,
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\IPython\core\ultratb.py", line 1087, in format_exception_as_a_whole
    frames.append(self.format_record(record))
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\IPython\core\ultratb.py", line 969, in format_record
    frame_info.lines, Colors, self.has_colors, lvals
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\IPython\core\ultratb.py", line 792, in lines
    return self._sd.lines
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\stack_data\utils.py", line 144, in cached_property_wrapper
    value = obj.__dict__[self.func.__name__] = self.func(obj)
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\stack_data\core.py", line 734, in lines
    pieces = self.included_pieces
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\stack_data\utils.py", line 144, in cached_property_wrapper
    value = obj.__dict__[self.func.__name__] = self.func(obj)
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\stack_data\core.py", line 681, in included_pieces
    pos = scope_pieces.index(self.executing_piece)
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\stack_data\utils.py", line 144, in cached_property_wrapper
    value = obj.__dict__[self.func.__name__] = self.func(obj)
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\stack_data\core.py", line 660, in executing_piece
    return only(
  File "C:\Users\Diego\Documents\proyectos\cienciaDatos\.env\lib\site-packages\executing\executing.py", line 190, in only
    raise NotOneValueFound('Expected one value, found 0')
executing.executing.NotOneValueFound: Expected one value, found 0

In [ ]:
df.join(df2)

#### Merge ####
Esta función de pandas te permite joinear por cualquier campo que tenga los DataFrames

In [39]:
dataJoineada = pd.merge(df, df2, how="inner", on="lenguaje")
dataJoineada

  lenguaje  ranking_x           creador  ranking_y
0   Python          1  Guido van Rossum          1
1      php          2    Rasmus Lerdorf          2
2     java          3     James Gosling          3

In [53]:
df = pd.DataFrame({
    'LENGUAJE' : ["Python", "php", "java"],
    'RANKING' : [1,2,3]
})
dataJoineada = pd.merge(df, df2, how="inner", on="lenguaje")
dataJoineada

KeyError: 'lenguaje'

In [54]:
df2

  lenguaje           creador  ranking
0   Python  Guido van Rossum        1
1      php    Rasmus Lerdorf        2
2     java     James Gosling        3

In [47]:
dataJoineada = pd.merge(df, df2, how="inner", left_on="LENGUAJE", right_on= "lenguaje")
dataJoineada

,LENGUAJE,RANKING,lenguaje_x,creador_x,ranking_x,lenguaje_y,creador_y,ranking_y,lenguaje,creador,ranking
0,Python,1,Python,Guido van Rossum,1,Python,Guido van Rossum,1,Python,Guido van Rossum,1
1,php,2,php,Rasmus Lerdorf,2,php,Rasmus Lerdorf,2,php,Rasmus Lerdorf,2
2,java,3,java,James Gosling,3,java,James Gosling,3,java,James Gosling,3

In [48]:
dataJoineada

  LENGUAJE  RANKING lenguaje           creador  ranking
0   Python        1   Python  Guido van Rossum        1
1      php        2      php    Rasmus Lerdorf        2
2     java        3     java     James Gosling        3

In [50]:
#dataJoineada = dataJoineada.drop(columns=["LENGUAJE"])

dataJoineada.drop(columns=["LENGUAJE", "RANKING"], inplace = True)



dataJoineada

  lenguaje           creador  ranking
0   Python  Guido van Rossum        1
1      php    Rasmus Lerdorf        2
2     java     James Gosling        3

In [56]:
df2

  lenguaje           creador  ranking
0   Python  Guido van Rossum        1
1      php    Rasmus Lerdorf        2
2     java     James Gosling        3

Una buena práctica puede ser la de renombrar la columna para que puedan usarla como índice

In [57]:
df = df.rename(columns = {"LENGUAJE": "lenguaje", "RANKING": "ranking"})
print(df)
dataJoineada = pd.merge(df, df2, how="inner", on= "lenguaje")
dataJoineada

  lenguaje  ranking
0   Python        1
1      php        2
2     java        3

  lenguaje  ranking_x           creador  ranking_y
0   Python          1  Guido van Rossum          1
1      php          2    Rasmus Lerdorf          2
2     java          3     James Gosling          3

In [68]:
#Hacer join con dos o más campos como índices
data1 = pd.DataFrame([[1,1,"Horacio", "Lopez"],
[2,3,"Carla", "Peterson"],
[4,4,"Juan", "Solá"]
], columns= ["id_cliente", "id_tramite", "nombre", "apellido"])

data2 = pd.DataFrame([[1,1,"Exitoso"],
[2,3,"En Tramite"],
[4,4,"En Observacion",]
], columns= ["id_cliente", "id_tramite", "resultado"])

In [69]:
data1

   id_cliente  id_tramite   nombre  apellido
0           1           1  Horacio     Lopez
1           2           3    Carla  Peterson
2           4           4     Juan      Solá

In [70]:
data2

   id_cliente  id_tramite       resultado
0           1           1         Exitoso
1           2           3      En Tramite
2           4           4  En Observacion

In [71]:
dataResultante = pd.merge(data1, data2, how="inner", on = ["id_cliente", "id_tramite"])
dataResultante = dataResultante[["id_cliente", "id_tramite", "resultado"]]
dataResultante

   id_cliente  id_tramite       resultado
0           1           1         Exitoso
1           2           3      En Tramite
2           4           4  En Observacion

In [72]:
dataResultante = pd.merge(data1[["id_cliente", "id_tramite", "apellido"]], 
                          data2, how="inner", on = ["id_cliente", "id_tramite"])
dataResultante

   id_cliente  id_tramite  apellido       resultado
0           1           1     Lopez         Exitoso
1           2           3  Peterson      En Tramite
2           4           4      Solá  En Observacion

In [80]:
df1 = pd.DataFrame([["Python", 1], ["php", 2], ["java", 3]], columns = ["lenguaje", "ranking"])
df2 = pd.DataFrame([["Python", 4], ["R", 5], ["Pascal", 6]], columns = ["lenguaje", "ranking"])

df = pd.concat([df1,df2])
df

  lenguaje  ranking
0   Python        1
1      php        2
2     java        3
0   Python        4
1        R        5
2   Pascal        6

In [75]:
#Quiero reiniciar el indice
df = df.reset_index()
df

   index    lenguaje  ranking
0      0      Python        1
1      1         php        2
2      2        java        3
3      0  Javascript        4
4      1           R        5
5      2      Pascal        6

In [76]:
df.drop(columns=["index"], inplace=True)

In [82]:
#Quiero setear el campo lenguaje como indice
df = df.set_index("lenguaje")
df

KeyError: "None of ['lenguaje'] are in the columns"

#### Pandas se utiliza para poder leer de diversas fuentes ####
read_json()  
read_excel()  
read_csv()   
read_sql()  
read_gbq()  

En esta página podrán encontrar todas las funciones de lectura y escritura [Documentacion](https://pandas.pydata.org/docs/reference/io.html)

In [87]:
json_str = '{"Courses":{"r1":"Spark"},"Fee":{"r1":"25000"},"Duration":{"r1":"50 Days"}}'
df = pd.read_json(json_str)
df

   Courses    Fee Duration
r1   Spark  25000  50 Days

In [88]:
#En este caso es una lista de diccionarios
json_str = '[{"Courses":"Spark","Fee":"25000","Duration":"50 Days","Discount":"2000"}]'
df = pd.read_json(json_str, orient='records')
df

  Courses    Fee Duration  Discount
0   Spark  25000  50 Days      2000

### Métodos de búsqueda ###

Para buscar por posición de índice se usa el método .iloc

In [92]:
df

          ranking           creador
lenguaje
Python          1  Guido van Rossum
php             2    Rasmus Lerdorf
java            3     James Gosling

In [90]:
matrix = [["Python", 1, "Guido van Rossum"], ["php", 2, "Rasmus Lerdorf"], ["java", 3, "James Gosling"]]
df = pd.DataFrame(matrix, columns = ["lenguaje", "ranking", "creador"])
df = df.set_index("lenguaje")
df.iloc[0]

ranking                   1
creador    Guido van Rossum
Name: Python, dtype: object

Para buscar por valor del índice se utiliza el método .loc

In [91]:
df.loc["java"]

ranking                3
creador    James Gosling
Name: java, dtype: object

### Filtrar Registros ###

In [ ]:
#Para ver un campo del DataFrame
#df["lenguaje"]
df.ranking

In [93]:
df[df.ranking <=2]

          ranking           creador
lenguaje
Python          1  Guido van Rossum
php             2    Rasmus Lerdorf

In [94]:
df[df["ranking"] == 3]

          ranking        creador
lenguaje
java            3  James Gosling

In [98]:
# | -> or
# & -> and
df[(df.ranking == 3) | (df.creador == "Rasmus Lerdorf")]

          ranking         creador
lenguaje
php             2  Rasmus Lerdorf
java            3   James Gosling

In [107]:
data99 = df[df.ranking.isin([1,3])][["creador"]]
data99

   ranking           creador
0        1  Guido van Rossum
1        2    Rasmus Lerdorf
2        3     James Gosling

In [108]:
#Tengan en cuenta que si uso las dobles comillas (") para definir un string, dentro de dicho string puedo usar
#simples comillas (') como parte de la cadena y viceversa
df.query("(ranking == 3) or (creador == 'Rasmus Lerdorf')")

          ranking         creador
lenguaje
php             2  Rasmus Lerdorf
java            3   James Gosling

### Vamos a levantar una base que se encuentra en formato .txt ###

In [109]:
#por defecto el método read_csv utiliza como separador la ",". Si nuestra base se encuentra
#separada por otro separador, como ";" se deberá realizar lo siguiente:
#data = pd.read_csv(ruta_archivo, sep=";")
data = pd.read_csv("./Data/titanic_train.txt")

In [110]:
#el método head devuelve los primeros registros. Si entre los paréntesis no colocamos la cantidad de registros
#que quiero visualizar, mostrará por defecto 5 registros
data.head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [111]:
#el método .columns nos mostrará todas las columnas que posee el
#DataFrame
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [113]:
#el método .tail trae las últimas filas
data.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

# Diccionario de los campos de la base
**Survived** -> Survival - target (0 = No, 1 = Si)\
**Pclass** -> Ticket Class (1 = 1st, 2 = 2nd, 3 = 3rd)\
**Sex** -> Sex (male, female)\
**Age** -> Age in years\
**SibSp** -> of siblings / spouses aboard the Titanic\
**Parch** -> of parents / children aboard the Titanic\
**Ticket** -> ticket number\
**Fare** -> Passenger Fare (Tarifa)\
**Cabin** -> cabin Number\
**Embarked** -> Port of Embarkation (C = Cherbourg, Q = Queenstown, S = Southampton)

#### Ejercicio: ####
configurar el campo PassengerId como índice

In [114]:
#Resolución de ejercicio
data = data.set_index("PassengerId")
data

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [115]:
#Una primera aproximación para entender nuestra base (por lo menos los valores numéricos) se usa describe()
data.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [116]:
#Para conocer los tipos de datos que tenemos en dataframe usamos dtypes
data.dtypes

Survived      int64
Pclass        int64
Name         object
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
dtype: object

In [117]:
#otro metodo para poder validar datos es el .info
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

#### Ejercicio: ####
Seleccionar el registro cuyo PassengerId es igual a 4

In [118]:
#Resolución de ejercicio
data.loc[4]

Survived                                               1
Pclass                                                 1
Name        Futrelle, Mrs. Jacques Heath (Lily May Peel)
Sex                                               female
Age                                                 35.0
SibSp                                                  1
Parch                                                  0
Ticket                                            113803
Fare                                                53.1
Cabin                                               C123
Embarked                                               S
Name: 4, dtype: object

### Vamos a Agrupar ###
Para agrupar (o el famoso group by de SQL) vamos a utilizar el método .groupby

In [119]:
agrupador = data.groupby("Sex")
agrupador

In [121]:
agrupador.size() / len(data) #el método .size nos devuelte la cantidad de elementos por el agrupador

Sex
female    0.352413
male      0.647587
dtype: float64

In [123]:
#Se puede hacer todo en una sola línea
data.groupby("Sex").size() / len(data)

Sex
female    0.352413
male      0.647587
dtype: float64

In [126]:
data.groupby("Survived").size() / len(data)

Survived
0    0.616162
1    0.383838
dtype: float64

In [130]:
#el método .sum nos permitirá sumar valores. Tener en cuenta que debemos seleccionar la variable
#que queremos sumar, sino realizará suma de todas las variables numéricas que posea la base
data.groupby("Sex").Survived.sum()

Sex
female    233
male      109
Name: Survived, dtype: int64

In [131]:
#Se puede hacer group by con más de un campo
data.groupby(["Sex", "Embarked"]).Age.mean() #el Método .mean() nos traerá el promedio de la variable

Sex     Embarked
female  C           28.344262
        Q           24.291667
        S           27.771505
male    C           32.998841
        Q           30.937500
        S           30.291440
Name: Age, dtype: float64

In [132]:
#El método .agg nos permitirá realizar muchas agregaciones al mismo tiempo
data.groupby("Sex").agg({"Age":["mean", "min", "max"],
                         "Survived": ["sum", "count"]})

              Age             Survived
             mean   min   max      sum count
Sex
female  27.915709  0.75  63.0      233   314
male    30.726645  0.42  80.0      109   577

In [133]:
#También podemos usar estos métodos sin el group by
data.Age.median()

28.0

In [138]:
#Puedo crear un nuevo dataframe
dataAgrupadaSex = data.groupby("Sex").Age.median().to_frame("medianaEdad")
dataAgrupadaSex

        medianaEdad
Sex
female         27.0
male           29.0

In [139]:
#El dataFrame anterior tiene a la variable Sex como índice, 
#reseteo el índice
dataAgrupadaSex = dataAgrupadaSex.reset_index()
dataAgrupadaSex

      Sex  medianaEdad
0  female         27.0
1    male         29.0

In [141]:
data = pd.merge(data, dataAgrupadaSex, how="inner", on="Sex")

In [143]:
data["ratioEdad"] = data["Age"] / data["medianaEdad"]
data

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,medianaEdad,ratioEdad
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,29.0,0.758621
1,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,29.0,1.206897
2,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,29.0,NaN
3,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,29.0,1.862069
4,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,29.0,0.068966
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S,27.0,0.925926
887,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S,27.0,0.814815
888,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q,27.0,1.444444
889,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,27.0,0.703704
890,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,27.0,NaN